app/Controllers/Kondisi.php

SELECT *
FROM `pesanan`
WHERE `kondisi` = 1
---
    public function index()
    {
        $data_view = [
            'judul' => 'Kondisi',
            'page_konten' => 'admin/kondisi',
        ];

        $pesanan = new PaketModel;
        $data['pesanan'] = $pesanan->where('kondisi', 1)->findAll();

SELECT *
FROM `pesanan`
WHERE `kondisi` = 0
---
    public function index1()
    {
        $data_view = [
            'judul' => 'Kondisi',
            'page_konten' => 'admin/kondisi1',
        ];

        $pesanan = new PaketModel;
        $data['pesanan'] = $pesanan->where('kondisi', 0)->findAll();

DELETE FROM `pesanan`
WHERE `kondisi` = 0
---
    public function deleteAll1()
    {
        $pesanan = new PaketModel;
        $builder =  $pesanan->table('pesanan');
        $builder->where('kondisi', 0)->delete();