app/Controllers/Table.php

SELECT *
FROM `pesanan`
---
    public function index()
    {
        $data_view = [
            'judul' => 'Admin',
            'page_konten' => 'admin/table',
        ];

        $pesanan = new PaketModel;
        $data['pesanan'] = $pesanan->findAll();